br.com.viniciusvalongo.testepratico2/AtendeClienteService.postman_collection.json

{
	"info": {
		"_postman_id": "6bc2e664-fd4c-415d-8780-e47cc9e11087",
		"name": "AtendeClienteService",
		"description": "\n",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "21181870",
		"_collection_link": "https://www.postman.com/lunar-module-operator-36481427/workspace/meu-vivo/collection/21181870-6bc2e664-fd4c-415d-8780-e47cc9e11087?action=share&creator=21181870&source=collection_link"
	},
	"item": [
		{
			"name": "consultaCEP",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							"// Verificar se o status da resposta é 200 OK\r",
							"pm.test(\"Status da resposta deve ser 200 OK\", function() {\r",
							"    pm.response.to.have.status(200);\r",
							"});\r",
							"\r",
							"// Validar que os campos do endereço não estão vazios\r",
							"\r",
							"pm.test(\"O campo BAIRRO não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<bairro>(.*?)<\\/bairro>/);\r",
							"    pm.expect(encontrado[1]).to.not.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							"pm.test(\"O campo CEP não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<cep>(.*?)<\\/cep>/);\r",
							"    pm.expect(encontrado[1]).to.not.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							"pm.test(\"O campo CIDADE não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<cidade>(.*?)<\\/cidade>/);\r",
							"    pm.expect(encontrado[1]).to.not.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							"pm.test(\"O campo COMPLEMENTO não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<complemento2>(.*?)<\\/complemento2>/);\r",
							"    pm.expect(encontrado[1]).to.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							"pm.test(\"O campo ENDEREÇO não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<end>(.*?)<\\/end>/);\r",
							"    pm.expect(encontrado[1]).to.not.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							"pm.test(\"O campo UF não deve ser vazio\", function() {\r",
							"    const xmlResponse = pm.response.text();\r",
							"    const encontrado = xmlResponse.match(/<uf>(.*?)<\\/uf>/);\r",
							"    pm.expect(encontrado[1]).to.not.equal(\"\");\r",
							"\r",
							"});\r",
							"\r",
							""
						],
						"type": "text/javascript"
					}
				},
				{
					"listen": "prerequest",
					"script": {
						"exec": [
							"//Esta setada na variavel de ambiente\r",
							"const cep = pm.environment.get(\"cep\");\r",
							"const requestBody = `<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\r",
							"    <soapenv:Header/>\r",
							"    <soapenv:Body>\r",
							"        <cli:consultaCEP>\r",
							"            <cep>${cep}</cep>\r",
							"        </cli:consultaCEP>\r",
							"    </soapenv:Body>\r",
							"</soapenv:Envelope>`;\r",
							"\r",
							"pm.request.body.raw = requestBody;\r",
							""
						],
						"type": "text/javascript"
					}
				}
			],
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
					"protocol": "https",
					"host": [
						"apps",
						"correios",
						"com",
						"br"
					],
					"path": [
						"SigepMasterJPA",
						"AtendeClienteService",
						"AtendeCliente"
					]
				}
			},
			"response": [
				{
					"name": "consultaCEP response",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <consultaCEP xmlns=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n      <cep>string</cep>\n    </consultaCEP>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
							"protocol": "https",
							"host": [
								"apps",
								"correios",
								"com",
								"br"
							],
							"path": [
								"SigepMasterJPA",
								"AtendeClienteService",
								"AtendeCliente"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <consultaCEPResponse xmlns=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n      <return>\n        <bairro>string</bairro>\n        <cep>string</cep>\n        <cidade>string</cidade>\n        <complemento2>string</complemento2>\n        <end>string</end>\n        <uf>string</uf>\n        <unidadesPostagem>\n          <diretoriaRegional>string</diretoriaRegional>\n          <endereco/>\n          <id>string</id>\n          <nome>string</nome>\n          <status>string</status>\n          <tipo>string</tipo>\n        </unidadesPostagem>\n      </return>\n    </consultaCEPResponse>\n  </soap:Body>\n</soap:Envelope>\n"
				},
				{
					"name": "consultaCEP fault - SQLException",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "incorrect body message",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
							"protocol": "https",
							"host": [
								"apps",
								"correios",
								"com",
								"br"
							],
							"path": [
								"SigepMasterJPA",
								"AtendeClienteService",
								"AtendeCliente"
							]
						}
					},
					"status": "not OK",
					"code": 500,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <SQLException xmlns=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n      <errorCode>100</errorCode>\n      <sQLState>string</sQLState>\n      <message>string</message>\n    </SQLException>\n  </soap:Body>\n</soap:Envelope>\n"
				},
				{
					"name": "consultaCEP fault - SigepClienteException",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "incorrect body message",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
							"protocol": "https",
							"host": [
								"apps",
								"correios",
								"com",
								"br"
							],
							"path": [
								"SigepMasterJPA",
								"AtendeClienteService",
								"AtendeCliente"
							]
						}
					},
					"status": "not OK",
					"code": 500,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <SigepClienteException xmlns=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">string</SigepClienteException>\n  </soap:Body>\n</soap:Envelope>\n"
				},
				{
					"name": "consultaCEP",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <consultaCEP xmlns=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n      <cep>53360-170</cep>\n    </consultaCEP>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
							"protocol": "https",
							"host": [
								"apps",
								"correios",
								"com",
								"br"
							],
							"path": [
								"SigepMasterJPA",
								"AtendeClienteService",
								"AtendeCliente"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Date",
							"value": "Mon, 24 Jul 2023 05:09:25 GMT"
						},
						{
							"key": "Content-Type",
							"value": "text/xml;charset=UTF-8"
						},
						{
							"key": "Content-Length",
							"value": "378"
						},
						{
							"key": "Connection",
							"value": "keep-alive"
						},
						{
							"key": "Set-Cookie",
							"value": "INGRESSCOOKIE=1690175366.7.17481.577652|835444ff6d2fd54741dcab3b865d31d6; Max-Age=3600; Path=/SigepMasterJPA; Secure; HttpOnly"
						},
						{
							"key": "Set-Cookie",
							"value": "LBprdint3=2923036682.47873.0000; path=/; Httponly; Secure"
						},
						{
							"key": "Set-Cookie",
							"value": "LBprdExt1=566886410.47873.0000; path=/; Httponly; Secure"
						},
						{
							"key": "X-Powered-By",
							"value": "Undertow/1"
						},
						{
							"key": "Strict-Transport-Security",
							"value": "max-age=15724800; includeSubDomains"
						}
					],
					"cookie": [],
					"body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <soap:Body>\n        <ns2:consultaCEPResponse xmlns:ns2=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n            <return>\n                <bairro>Tabajara</bairro>\n                <cep>53360170</cep>\n                <cidade>Olinda</cidade>\n                <complemento2></complemento2>\n                <end>Rua Palmeira Real</end>\n                <uf>PE</uf>\n            </return>\n        </ns2:consultaCEPResponse>\n    </soap:Body>\n</soap:Envelope>"
				}
			]
		}
	],
	"variable": [
		{
			"key": "AtendeClientePortBaseUrl",
			"value": "https://apps.correios.com.br",
			"type": "any"
		}
	]
}